'''Задача 2. Дешифратор
Что нужно сделать
Чтобы повысить уровень доверия Пети к нашему дешифратору из предыдущего модуля, напишите тесты на все проверки,
которые есть в задании:

абра-кадабра. → абра-кадабра
абраа..-кадабра → абра-кадабра
абраа..-.кадабра → абра-кадабра
абра--..кадабра → абра-кадабра
абрау...-кадабра → абра-кадабра
абра........ → <пустая строка>
абр......a. → a
1..2.3 → 23
. → <пустая строка>
1....................... → <пустая строка>'''
import sys


for_test_dict ={'абра-кадабра.': 'абра-кадабра',
                'абраа..-кадабра': 'абра-кадабра',
                'абраа..-.кадабра': 'абра-кадабра',
                'абра--..кадабра': 'абра-кадабра',
                'абрау...-кадабра': 'абра-кадабра',
                'абра........': '',
                'абр......a.': 'a',
                '1..2.3': '23',
                '.': ''
                }

def decrypt(code: str)-> str:
    decode = ''
    cnt_letter = 0
    cnt_point = 0
    for i_elem in code:
        cnt_letter += 1
        if i_elem == '.':
            cnt_point += 1
            if cnt_point > 1:
                decode = decode[:cnt_letter - 3]
                cnt_point = 0
                cnt_letter = len(decode)
        else:
            decode += i_elem

    return decode

code_list = ['абра-кадабра.', 'абраа..-кадабра', 'абраа..-.кадабра', 'абра--..кадабра', 'абрау...-кадабра',
             'абра........', 'абр......a.', '1..2.3', '1.......................']
key_list = ['абра-кадабра', 'абра-кадабра','абра-кадабра','абра-кадабра','абра-кадабра','абра-кадабра',
            '', 'a', '23', '']
# code = sys.stdin.read()
for i in code_list:
    print(decrypt(i))